In [ ]:
import duckdb
import pandas as pd
import os
import sys
from datetime import datetime

In [3]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [20]:
arquivo = 'z0019_1.csv'
df = pd.read_csv(f'../landing/{arquivo}',sep=';')
df.head()

   NATBR     MAKTX WERKS  MAINS  LABST
0  10001  PARAFUSO  BT10    100    100
1  10002   MARTELO  BT50    100    500
2  10003     PREGO  BT10    100     50

In [ ]:
print(datetime.no)